[
  {
    "key": "cloudinary",
    "tier": "gold",
    "name": "Cloudinary",
    "url": "https://cloudinary.com",
    "logo": "cloudinary.png",
    "square": "cloudinary-square.png",
    "workshop": "Performance-First Ecommerce & Visual Web Experiences with Cloudinary",
    "workshop_link": "/workshops/ecommerce-cloudinary",
    "video_id": "b34ea2f90a631942da0075cbb17974fc",
    "description": "Developers use Cloudinary to quickly and easily create, manage and deliver their digital experiences across any browser, device and bandwidth."
  },
  {
    "key": "courier",
    "tier": "gold",
    "name": "Courier",
    "url": "https://www.courier.com/",
    "logo": "courier.png",
    "square": "courier-square.png",
    "workshop": "Sending Multi-channel Alerts From Your Node.JS Environment with Courier",
    "workshop_link": "/workshops/alerts-nodejs-courier",
    "description": "Notifications are hard. They require infrastructure that is reliable, scalable and observable as well as an end user experience that is helpful and respectful. That's why we built Courier. Courier is a complete notification system that allows you to design and send notifications across all channels, orchestrate your workflow, and collect real-time insights.",
    "short": "Notifications are hard, that's why we built Courier."
  },
  {
    "key": "circle-ci",
    "tier": "gold",
    "name": "CircleCI",
    "url": "https://circleci.com",
    "logo": "circleci.svg",
    "square": "circleci-square.png",
    "description": "The world's best software teams use CircleCI to deliver quality code with confidence. As the largest continuous integration and delivery (CI/CD) platform, CircleCI empowers engineers to seamlessly take ideas to execution, at scale. Our platform is optimized for developer productivity, speed, and confidence.We understand how engineering teams work and how their code runs. Companies like Intuit, Apple, and Spotify use CircleCI to improve productivity, release better products, and get to market faster. We've been named a leader in cloud-native continuous integration by Forrester in 2019 and 2017, and rank #242 on Deloitte's Technology Fast 500™.",
    "short": "The world's best software teams use CircleCI to deliver quality code with confidence."
  
  },
  {
    "key": "vonage",
    "tier": "gold",
    "name": "Vonage",
    "url": "https://vonage.dev/cascadiajs",
    "logo": "vonage.png",
    "square": "vonage-square.png",
    "video_id": "2edd33fd988cd03a9c7050398b6bb8e1",
    "description": "Vonage has everything you need to build connected applications with their APIs for SMS, Voice, Video, Verify and more. Whether you want to make and receive phone calls with code, reach users by the messaging platforms they prefer or ensure that users provide the correct contact details, they’ve got you covered. Easily integrate with social chat apps such as Facebook Messenger, WhatsApp and Viber, or build in-app voice and messaging experience on mobile and web. Vonage has quick solutions made easy for you.",
    "short": "Everything you need to build connected applications with APIs for SMS, Voice, Video, Verify & more."
  },
  {
    "key": "formidable",
    "tier": "gold",
    "name": "Formidable",
    "url": "https://formidable.com",
    "logo": "formidable.svg",
    "square": "formidable-square.png",
    "video_id": "4f837f07c0c6387cb752f33c55a15d24",
    "description": "We build the modern web."
  },
  {
    "key": "dolby",
    "tier": "gold",
    "name": "Dolby.io",
    "url": "https://dolby.io",
    "logo": "dolby.svg",
    "square": "dolby-square.png",
    "jobs": "https://dolby.io/careers/",
    "workshop": "Learn Babylon.js to Create Your Own 3D Metaverse Environments",
    "workshop_link": "/workshops/babylonjs-metaverse",
    "description": "High-fidelity audio and video for all. Join the many developers, businesses, and creators turning to Dolby.io APIs to build high-quality communications, media, and streaming solutions that transform customer experiences, drive efficient workflows, and delight users.",
    "short": "High-fidelity audio and video for all."
  },
  {
    "key": "contrast-security",
    "tier": "gold",
    "name": "Contrast Secutiry",
    "url": "https://www.contrastsecurity.com",
    "logo": "contrast-security.png",
    "square": "contrast-security-square.png",
    "jobs": "https://www.contrastsecurity.com/contrast-careers",
    "description": "Contrast Security empowers developers to secure-as-they code. The Secure Code Platform enables developers to write and release secure code faster, remove security roadblocks, eliminate false positives, and quickly remediate vulnerabilities.",
    "short": "Contrast Security empowers developers to secure-as-they code."
  },
  {
    "key": "circle",
    "tier": "gold",
    "name": "Circle",
    "url": "https://www.circle.com",
    "logo": "circle.png",
    "square": "circle-square.png",
    "jobs": "https://www.circle.com/en/careers",
    "job_desc": "At Circle, we envision a global economy where people and businesses everywhere can more freely connect and transact with each other, through a system that has the reach and accessibility of the internet and knows no borders or boundaries. We believe that such a system can raise prosperity for people and companies anywhere.",
    "workshop": "Connecting the Fiat and Crypto Worlds with Digital Dollars",
    "workshop_link": "/workshops/digital-payments-circle",
    "video_id": "59bb7f84837e56007a9d5ab608c1d4a7",
    "description": "Circle is a global financial technology firm that's at the center of digital currency innovation and open financial infrastructure. We bridge the traditional financial system and the world's leading public blockchains to unlock growth for businesses and investors around the world.",
    "short": "Payments & treasury infrastructure for the internet"
  },
  {
    "key": "codingscape",
    "tier": "silver",
    "name": "Codingscape",
    "url": "https://codingscape.com",
    "logo": "codingscape.svg",
    "square": "codingscape-square.png",
    "jobs": "https://codingscape.com/jobs",
    "job_desc": "The Codingscape Team is a US based group of senior engineers that have over 20 years building unique products, experiences, and implementing processes for Fortune 500 companies together. We can manage the entire software project lifecycle from start to finish or work directly with existing product and development teams. The Codingscape team is comfortable working in both enterprise and startup environments.\n\nOur highest commitment is to our team. This means you! Working with world-class developers is our foremost goal. We value colleagues who have high integrity, excellent communication and who are fantastic at their job.  Codingscape is a remote native organization, and no positions require travel or for work to be done in an office.",
    "description": "Codingscape is a custom software development company specializing in high-quality development projects.  Our team of Senior Software Engineers are all based in North America and are experts at contributing to your projects quickly.",
    "short": "Codingscape is a custom software development company specializing in high-quality development projects."
  },
  {
    "key": "begin",
    "tier": "silver",
    "name": "Begin",
    "url": "https://begin.com",
    "logo": "begin.svg",
    "square": "begin-square.png",
    "description": "Begin is a ridiculously quick platform for building modern web apps, sites, and APIs. Get started for free."  
  },
  {
    "key": "turing",
    "tier": "silver",
    "name": "Turing School of Software and Design",
    "url": "https://terminal.turing.edu/",
    "logo": "turing.png",
    "square": "turing-square.png",
    "description": "Turing School of Software & Design is a seven month, federally accredited, immersive training program. Our students specialize through the Front-End Engineering program focusing on JavaScript and React or our Back-End Engineering program with Ruby and Rails. Because they build a foundation in problem-solving, collaboration, and fast-learning, we find that about a quarter of graduates go to work in technologies we didn't teach them like Python, Java, Salesforce, Angular, TypeScript, etc.\n\nSeparate programs with a longer time frame allow students to get a deeper understanding of their chosen specialty in addition to the basic skills needed to work in a modern web development team. When Turing students graduate, they're ready to hit the ground running. Let us help you find the one that's right for you.",
    "short": "A seven month, federally accredited, immersive training program."
  },
  {
    "key": "fictiv",
    "tier": "silver",
    "name": "Fictiv",
    "url": "https://www.fictiv.com",
    "logo": "fictiv.png",
    "square": "fictiv-square.png",
    "description": "Build the future of manufacturing.",
    "jobs": "https://www.fictiv.com/careers",
    "job_desc": "Fictiv is a rapidly growing, all-in-one manufacturing SaaS platform that works with companies such as Ford, Honeywell, NASA, SpaceX and Tesla, helping them build groundbreaking technology since 2013.\n\nCutting-edge companies choose us because we accelerate innovations in the supply chain industry, bringing speed and automation to historically slow and tedious processes.\n\nWe're always looking for technology leads, and software and engineering talent, so come build the future with us!"
  },
  {
    "key": "retool",
    "tier": "silver",
    "name": "Retool",
    "url": "https://www.retool.com",
    "logo": "retool.png",
    "square": "retool-square.jpg",
    "jobs": "https://retool.com/careers/",
    "job_desc": "Retool is a fast way to build internal tools. You visually design apps that interface with any database or API, and switch to code nearly anywhere to customize how your apps look or work. By removing the friction to build internal tools, we help developers solve operational challenges with custom tools while keeping the team focused on high-value work. Thousands of teams at companies like Amazon, DoorDash, Peloton, and Brex collaborate around custom-built Retool apps to solve internal workflows.",
    "description": "Retool is a fast way to build internal tools. You visually design apps that interface with any database or API, and switch to code nearly anywhere to customize how your apps look or work. By removing the friction to build internal tools, we help developers solve operational challenges with custom tools while keeping the team focused on high-value work. Thousands of teams at companies like Amazon, DoorDash, Peloton, and Brex collaborate around custom-built Retool apps to solve internal workflows.",
    "short": "Build internal tools, remarkably fast."
  },
  {
    "key": "mux",
    "tier": "silver",
    "name": "Mux",
    "url": "https://get.mux.com/3GBeOis",
    "logo": "mux.png",
    "square": "mux-square.png",
    "jobs": "https://www.mux.com/jobs",
    "description": "Mux is a powerful API to video and performance monitoring platform. POST a video; GET back a video URL that plays well on any device. Founded by video experts, including the creators of the biggest open-source video player (Video.js), Mux makes beautiful video possible for every development team.\n\nBuild on-demand and live streaming video into your apps and products, all while tracking performance and engagement — no matter the size of your development team.\n\nGet a $50 Mux credit to build video into your product using the Mux Video API. [Sign up](https://get.mux.com/3GBeOis) for an account, email us at deal+cascadiajs22@mux.com, and mention CascadiaJS to get your free credits.",
    "short": "Video infrastructure for the internet 📺",
    "job_desc": "Mux is video for developers. Our mission is to democratize video by solving the hard problems developers face when building video: video encoding and streaming (Mux Video), video monitoring (Mux Data), and more. Video is a huge part of people’s lives, and we want to help make it better. We’re committed to building a healthy team that welcomes a diverse range of backgrounds and experiences. We want people who care about our mission, are ready to grow, believe in our values (from Be Human to Turn Customers Into Fans), and want to make the people around them better."
  },
  {
    "key": "netlify",
    "tier": "bronze",
    "name": "Netlify",
    "url": "https://netlify.com",
    "logo": "netlify.svg",
    "square": "netlify-square.jpg",
    "description": "The fastest way to combine your favorite tools and APIs to build the fastest sites, stores, and apps for the web."
  },
  {
    "key": "fission",
    "tier": "community",
    "name": "Fission",
    "url": "https://fission.codes",
    "logo": "fission.png",
    "square": "fission-square.jpg",
    "description": "Building protocols for the future of the Internet"
  },
  {
    "key": "nx",
    "tier": "community",
    "name": "Nx",
    "url": "https://nx.dev",
    "logo": "nx.png",
    "jobs": "https://nrwl.io/careers",
    "description": "Nx is a smart, fast, and extensible open source build system with first-class monorepo support and powerful integrations. It was created and is maintained by Nrwl, a growing team of software development experts with extensive experience helping startups and Fortune 500's alike build better software through better developer experience and smarter devops.",
    "short": "Nx is a smart, fast, and extensible open source build system with first-class monorepo support and powerful integrations."
  },
  {
    "key": "appwrite",
    "tier": "community",
    "name": "Appwrite",
    "url": "https://appwrite.io",
    "logo": "appwrite.png",
    "description": "Secure Open-Source Backend Server for Web, Mobile & Flutter Developers"
  },
  {
    "key": "postman",
    "tier": "community",
    "name": "Postman",
    "url": "https://www.postman.com",
    "logo": "postman.svg",
    "square": "postman-square.png",
    "description": "Browse the largest network of APIs and share what you build with 20 million developers across the planet."
  },
  {
    "key": "xata",
    "tier": "community",
    "name": "Xata",
    "url": "https://xata.io",
    "logo": "xata.svg",
    "square": "xata-square.jpg",
    "description": "The go-to Serverless Database of your dreams"
  },
  {
    "key": "datadog",
    "tier": "community",
    "name": "Datadog",
    "url": "https://www.datadoghq.com",
    "logo": "datadog.png",
    "square": "datadog-square.png",
    "description": "Datadog is the essential monitoring and security platform for cloud applications. We bring together end-to-end traces, metrics, and logs to make your applications, infrastructure, and third-party services entirely observable. These capabilities help businesses secure their systems, avoid downtime, and ensure customers are getting the best user experience.",
    "short": "The essential monitoring and security platform for cloud applications."
  },
  {
    "key": "liveloveapp",
    "tier": "community",
    "name": "LiveLoveApp",
    "url": "https://liveloveapp.com",
    "logo": "liveloveapp.png",
    "square": "liveloveapp.jpg",
    "description": "### Who is LiveLoveApp?\n\nBrian Love and Mike Ryan are the founders of LiveLoveApp and have a combined 30 years of experience in product & technology leadership inside of Fortune 500 companies, government, and hungry startups.\n\nTheir passion for technology has led them to create open-source software with millions of downloads, speak at conferences around the world, and craft apps that delight users.\n\nWe have three primary services that we offer to our clients:\n\n* Fractional CTO Product Leadership\n* Expert-led Workshops\n* Software Architecture\n\n### Fractional CTO Product Leadership\n\nKnowing how to build web apps and cloud services that are performant and delight users is daunting. It would be best if you had technical leadership to help identify solutions to product problems.\n\n LiveLoveApp has helped startups go to market rapidly with efficient operations. We offer engineering and consulting services for startups that are building for the modern web in the cloud.\n\n### Workshops\n\nBuilding build better apps that are performant, reliable, and high quality requires supplying your team with the necessary education. You want to bring in industry experts to skill up your team and help them close their knowledge gaps.\n\nLiveLoveApp has trained thousands of software engineers on tools and technologies for the modern web. We offer workshops in-person, online, or hybrid with straightforward pricing and no hidden costs.\n\n### Software Architecture\n\nWeb apps and cloud systems with poor performance and bad reliability result in low code development velocity. Your users expect delightful experiences that evolve to meet their needs. You want to identify bottlenecks and design a plan to improve your web app or cloud system.\n\nLiveLoveApp has provided architecture reviews and designs to startups and enterprises. We analyze your current application and system architecture to provide a clear path towards increased performance, quality, and velocity.\n\n### Say Hello!\n\nEmail us at: hello@liveloveapp.com\n\nOr, [schedule a 30-minute call with us directly](https://liveloveapp.com/contact).",
    "short": "Find Absolute Joy in Shipping Apps. Product & Technology Leadership through Consulting, Architecture Design, and Workshops"
  },
  {
    "key": "seattlejs",
    "tier": "community",
    "name": "SeattleJS",
    "url": "https://seattlejs.com",
    "logo": "seattlejs.png",
    "description": "The longest running web and JS meetup in Seattle. All are welcome!"
  },
  {
    "key": "seattle-node",
    "tier": "community",
    "name": "Seattle Node.js Meetup",
    "url": "https://www.meetup.com/seattle-node-js/",
    "logo": "seattle-node.png",
    "description": "This is a group dedicated to learning, spreading the knowledge of, and improving Node.js - the evented, server side javascript platform harnessing the underlying power of Google's V8 JS engine.\n\nYou should join us if you want to learn about, share experiences with, or work to improve Node.js and its modules.",
    "short": "Seattle's Node.js meetup"
  },
  {
    "key": "seattle-reactjs",
    "tier": "community",
    "name": "Seattle React.js meetup",
    "url": "https://www.meetup.com/seattle-react-js/",
    "logo": "seattle-reactjs.jpg",
    "description": "React.js is a fun, easy to use Javascript library built at Facebook.\n\nYou should join us if you want to learn about, share experiences with, or work with fellow JavaScript devs interested in React.",
    "short": "Seattle's React.js Meetup"
  },
  {
    "key": "portland-angular",
    "tier": "community",
    "name": "Portland Angular.js Meetup",
    "url": "https://www.meetup.com/ngpdxers/",
    "logo": "portland-angular.jpg",
    "description": "We are a community of JavaScript enthusiasts that share a love for Angular. Some of us have been using it for years and others are just hearing about it.\n\nEach month we get together to hear about all the great things that make up the Angular framework and see what great things people are creating with it.\n\nWe'd love to have you join us!",
    "short": "We are a community of JS enthusiasts in Portland, OR that share a love for Angular."
  },
  {
    "key": "openjs",
    "tier": "community",
    "name": "OpenJS Foundation",
    "url": "https://openjsf.org/",
    "logo": "openjs.svg",
    "square": "openjs-square.png",
    "description": "Our mission is to support the healthy growth of JavaScript and web technologies by providing a neutral organization to host and sustain projects, as well as collaboratively fund activities that benefit the ecosystem as a whole.",
    "short": "Our mission is to support the healthy growth of JavaScript and web technologies"
  },
  {
    "key": "codeday",
    "tier": "community",
    "name": "Code Day",
    "url": "https://www.codeday.org/",
    "logo": "codeday.png",
    "square": "codeday-square.png",
    "description": "A non-profit providing welcoming and diverse opportunities for under-served students to explore a future in tech and beyond."
  },
  {
    "key": "techtonica",
    "tier": "community",
    "name": "Techtonica.org",
    "url": "https://techtonica.org",
    "logo": "techtonica.png",
    "square": "techtonica-square.jpg",
    "description": "[Techtonica](https://techtonica.org/) is a non-profit organization that helps women and non-binary adults with low incomes overcome barriers into tech careers. We offer free training, stipends, laptops, personal mentors, and job placements to our participants.\n\nWe started in the Bay Area and are now completely remote, which allows us to support many more people in their tech journey! With this expansion, we need more volunteers to [sign up](https://docs.google.com/forms/d/e/1FAIpQLSeW0mo-Dpsig70374UEPvzexpas-31Ost_HsFwm0kjNOxtbtg/viewform?c=0&w=1) to help our participants during:\n* Study groups\n* Workshops\n* Weekly office hours\n* Mentoring (two hours per week)\n\nWe also welcome donations at techtonica.org/donate, but our program is mostly funded by companies that [sponsor and hire our program participants](https://techtonica.org/sponsor/). If your company might be interested in collaborating with us, please contact us!",
    "short": "Non-profit org that helps women and non-binary adults with low incomes overcome barriers into tech careers."
  },
  {
    "key": "codefellows",
    "tier": "community",
    "name": "Codefellows",
    "url": "https://bit.ly/3y35Isp",
    "logo": "codefellows.png",
    "square": "codefellows-square.png",
    "description": "Code Fellows started in 2013 as Seattle's first code school, with a class of 20 aspiring software developers. A lot has changed since that first cohort — we've expanded our curriculum to include courses that range from beginner to advanced; moved to a bigger, brighter campus in the heart of Seattle; went fully virtual, added new curriculum in operations and cybersecurity; launched Powered by Code Fellows, built out our robust Career Transition Services Program; and much more.\n\nWe guide people from all backgrounds to change their lives through fast-paced, career-focused education. We shape passionate learners with immersive training to meet industry needs and improve diversity.",
    "short": "We guide people from all backgrounds to change their lives through fast-paced, career-focused education."
  },
  {
    "key": "1859",
    "tier": "community",
    "name": "1859 Ventures",
    "url": "http://1859.vc",
    "logo": "1859.png",
    "square": "1859-square.jpg",
    "description": "1859 Ventures is an Oregon-based seed-stage fund focused on helping underserved founders. An industry agnostic fund, 1859 focuses on helping women, BIPOC, LGBTQ+, military veterans, and first-time founders who are building the next big businesses here in the state of Oregon.",
    "short": "Oregon-based seed-stage fund focused on helping underserved founders."
  },
  {
    "key": "200ok",
    "tier": "community",
    "name": "200 OK",
    "url": "https://200ok.vc",
    "logo": "200ok.png",
    "description": "200 OK invests in startups building the next-generation of dev tools."
  },
  {
    "key": "edco",
    "tier": "community",
    "name": "EDCO",
    "url": "https://edcoinfo.com/",
    "logo": "edco.png",
    "square": "edco-square.png",
    "short": "A non-profit whose mission is to support the economic development of Central Oregon",
    "description": "Founded in 1981, EDCO is a non-profit corporation supported by private and public members and stakeholders. Our mission is to create a diversified local economy and a strong base of middle-class jobs in Central Oregon."
  },
  {
    "key": "tao",
    "tier": "community",
    "name": "TAO",
    "url": "https://www.techoregon.org/",
    "logo": "tao.png",
    "square": "tao-square.jpg",
    "description": "The Technology Association of Oregon is creating and uniting a world-class innovation economy in Oregon and beyond."
  },
  {
    "key": "106-miles",
    "tier": "community",
    "name": "106 Miles",
    "url": "https://meetup.com/106miles",
    "logo": "106-miles.jpg",
    "square": "106-miles-square.jpg",
    "short": "We help entrepreneurial engineers and get honest information about the ins and outs of venture backed startups.",
    "description": "We are a long-running nonprofit based in Silicon Valley, whose mission is to help entrepreneurial engineers navigate the tech industry. We host face to face meetups in San Francisco and Palo Alto, where you can meet fellow entrepreneurs and get honest information about the ins and outs of venture backed startups."
  }
]
